var getPowerList = {
  "chartList": [
    {
      "capacity": "721",
      "energy": "1268936.65",
      "id": 33,
      "lat": 31.338994,
      "lon": 120.911773,
      "name": "维信诺光伏电站",
      "power": "135165.0"
    },
    {
      "capacity": "10.4",
      "energy": "17056.92",
      "id": 66,
      "lat": 31.112247,
      "lon": 121.379376,
      "name": "闵行科委",
      "power": "1630.0"
    },
    {
      "capacity": "213.5",
      "energy": "288212.03",
      "id": 132,
      "lat": 0,
      "lon": 0,
      "name": "福联电子光伏电站",
      "power": "39607.0"
    },
    {
      "capacity": "615.66",
      "energy": "714823.05",
      "id": 133,
      "lat": 0,
      "lon": 0,
      "name": "昆山德国工业园绿色孵化基地光伏电站",
      "power": "125272.0"
    },
    {
      "capacity": "30",
      "energy": "26568.91",
      "id": 178,
      "lat": 30.223215,
      "lon": 121.371094,
      "name": "贝尔诺电站#1",
      "power": "2864.0"
    },
    {
      "capacity": "1188.2",
      "energy": "695698.39",
      "id": 319,
      "lat": 0,
      "lon": 0,
      "name": "泰埃卡光伏电站",
      "power": "176607.0"
    },
    {
      "capacity": "224.44",
      "energy": "142662.41",
      "id": 326,
      "lat": 31.262733,
      "lon": 121.025749,
      "name": "国置精密机械光伏电站",
      "power": "43334.0"
    },
    {
      "capacity": "300.08",
      "energy": "183998.78",
      "id": 353,
      "lat": 31.385598,
      "lon": 120.980737,
      "name": "鑫莹蕾光伏电站",
      "power": "46255.0"
    },
    {
      "capacity": "28.08",
      "energy": "13700.76",
      "id": 366,
      "lat": 30.210313,
      "lon": 117.486306,
      "name": "来田办公楼9户",
      "power": "1296.0"
    },
    {
      "capacity": "120",
      "energy": "66128.06",
      "id": 368,
      "lat": 30.143157,
      "lon": 117.372571,
      "name": "库山60KW",
      "power": "13796.0"
    },
    {
      "capacity": "60",
      "energy": "29693.81",
      "id": 370,
      "lat": 30.165042,
      "lon": 117.360443,
      "name": "西柏村60KW",
      "power": "3808.0"
    },
    {
      "capacity": "60",
      "energy": "32027.78",
      "id": 372,
      "lat": 30.299404,
      "lon": 117.304291,
      "name": "梓丰村60KW",
      "power": "5524.0"
    },
    {
      "capacity": "60",
      "energy": "31020.19",
      "id": 374,
      "lat": 30.237846,
      "lon": 117.256966,
      "name": "九步村60KW",
      "power": "3279.0"
    },
    {
      "capacity": "60",
      "energy": "33443.07",
      "id": 380,
      "lat": 30.243889,
      "lon": 117.235092,
      "name": "来田村60KW村级电站",
      "power": "71.0"
    },
    {
      "capacity": "120",
      "energy": "71406.5",
      "id": 386,
      "lat": 33.579683,
      "lon": 109.677364,
      "name": "安源村120KW",
      "power": "6596.0"
    },
    {
      "capacity": "60",
      "energy": "28271.9",
      "id": 395,
      "lat": 30.207468,
      "lon": 117.426247,
      "name": "杏溪村级电站60KW",
      "power": "4103.0"
    },
    {
      "capacity": "60",
      "energy": "32675.92",
      "id": 398,
      "lat": 30.265638,
      "lon": 117.441544,
      "name": "矶滩60KW",
      "power": "0.0"
    },
    {
      "capacity": "120",
      "energy": "49945.49",
      "id": 400,
      "lat": 30.26112,
      "lon": 117.444336,
      "name": "太康120KW户用电站",
      "power": "7293.0"
    },
    {
      "capacity": "113",
      "energy": "66255.73",
      "id": 412,
      "lat": 0,
      "lon": 0,
      "name": "昆山金门工贸光伏电站",
      "power": "21912.0"
    },
    {
      "capacity": "204.6",
      "energy": "118099.09",
      "id": 430,
      "lat": 31.441614,
      "lon": 120.945932,
      "name": "昆山万利机械光伏电站",
      "power": "37012.0"
    },
    {
      "capacity": "938.7",
      "energy": "297294.54",
      "id": 435,
      "lat": 31.395077,
      "lon": 120.923198,
      "name": "昆山好家居光伏电站",
      "power": "183091.0"
    },
    {
      "capacity": "472.44",
      "energy": "184196.23",
      "id": 467,
      "lat": 31.385598,
      "lon": 120.980737,
      "name": "锦溪佳途光伏电站",
      "power": "110746.0"
    },
    {
      "capacity": "55.8",
      "energy": "16577.57",
      "id": 479,
      "lat": 31.453475,
      "lon": 120.922933,
      "name": "科瑞泰克#1光伏电站",
      "power": "8218.0"
    },
    {
      "capacity": "55.8",
      "energy": "15734.29",
      "id": 480,
      "lat": 31.453475,
      "lon": 120.922933,
      "name": "科瑞泰克#2光伏电站",
      "power": "7879.0"
    },
    {
      "capacity": "55.8",
      "energy": "16325.96",
      "id": 481,
      "lat": 31.453475,
      "lon": 120.922933,
      "name": "科瑞泰克#3光伏电站",
      "power": "7916.0"
    },
    {
      "capacity": "55.8",
      "energy": "15511.31",
      "id": 482,
      "lat": 31.453475,
      "lon": 120.922933,
      "name": "科瑞泰克#4光伏电站",
      "power": "7946.0"
    },
    {
      "capacity": "57.04",
      "energy": "16834.71",
      "id": 483,
      "lat": 31.453475,
      "lon": 120.922933,
      "name": "科瑞泰克#5光伏电站",
      "power": "8089.0"
    },
    {
      "capacity": "57.04",
      "energy": "16137.92",
      "id": 484,
      "lat": 31.453475,
      "lon": 120.922933,
      "name": "科瑞泰克#6光伏电站",
      "power": "8248.0"
    },
    {
      "capacity": "57.04",
      "energy": "16730.29",
      "id": 485,
      "lat": 31.453475,
      "lon": 120.922933,
      "name": "科瑞泰克#7光伏电站",
      "power": "8240.0"
    },
    {
      "capacity": "57.04",
      "energy": "16841.66",
      "id": 486,
      "lat": 31.453475,
      "lon": 120.922933,
      "name": "科瑞泰克#8光伏电站",
      "power": "8320.0"
    },
    {
      "capacity": "900.24",
      "energy": "336906.14",
      "id": 489,
      "lat": 31.446817,
      "lon": 120.949738,
      "name": "昆山鸿永盛光伏电站",
      "power": "162730.0"
    },
    {
      "capacity": "119.04",
      "energy": "29913.56",
      "id": 530,
      "lat": 0,
      "lon": 0,
      "name": "金箭机械光伏电站",
      "power": "21169.0"
    },
    {
      "capacity": "125.24",
      "energy": "37728.16",
      "id": 533,
      "lat": 0,
      "lon": 0,
      "name": "金昆机械光伏电站",
      "power": "22021.0"
    },
    {
      "capacity": "448.88",
      "energy": "103338.37",
      "id": 542,
      "lat": 0,
      "lon": 0,
      "name": "昆山岳众光伏电站",
      "power": "66184.0"
    },
    {
      "capacity": "355.88",
      "energy": "129038.52",
      "id": 551,
      "lat": 0,
      "lon": 0,
      "name": "昆山铂翔光伏电站",
      "power": "64645.0"
    },
    {
      "capacity": "221.96",
      "energy": "55549.99",
      "id": 559,
      "lat": 0,
      "lon": 0,
      "name": "唐佳光伏电站",
      "power": "43098.0"
    },
    {
      "capacity": "442.68",
      "energy": "104740.16",
      "id": 560,
      "lat": 0,
      "lon": 0,
      "name": "舒雅光伏电站",
      "power": "70523.0"
    },
    {
      "capacity": "1884",
      "energy": "213621.2",
      "id": 576,
      "lat": 0,
      "lon": 0,
      "name": "天大环保光伏电站",
      "power": "260290.0"
    },
    {
      "capacity": "1630",
      "energy": "364598.37",
      "id": 607,
      "lat": 0,
      "lon": 0,
      "name": "天大石化光伏电站",
      "power": "378884.0"
    },
    {
      "capacity": "17.36",
      "energy": "3739.44",
      "id": 643,
      "lat": 0,
      "lon": 0,
      "name": "上海大学通信与信息工程学院",
      "power": "2938.0"
    },
    {
      "capacity": "773.76",
      "energy": "236933.67",
      "id": 644,
      "lat": 30.788905,
      "lon": 121.213229,
      "name": "金山市场有限公司",
      "power": "74947.0"
    },
    {
      "capacity": "79.36",
      "energy": "2356.26",
      "id": 734,
      "lat": 0,
      "lon": 0,
      "name": "辑里丝绸光伏电站",
      "power": "13935.0"
    },
    {
      "capacity": "370.76",
      "energy": "43585.13",
      "id": 837,
      "lat": 0,
      "lon": 0,
      "name": "华利电子光伏电站",
      "power": "45179.0"
    },
    {
      "capacity": "40.04",
      "energy": "5153.78",
      "id": 888,
      "lat": 32.674567,
      "lon": 119.2326,
      "name": "高邮市中杰水利机械公司40kw光伏电站",
      "power": "9257.0"
    },
    {
      "capacity": "4.92",
      "energy": "763.86",
      "id": 957,
      "lat": 0,
      "lon": 0,
      "name": "福联测试光伏电站",
      "power": "1042.0"
    },
    {
      "capacity": "40.04",
      "energy": "3816.85",
      "id": 963,
      "lat": 32.781659,
      "lon": 119.459161,
      "name": "红兴旺40kw电站",
      "power": "9281.0"
    },
    {
      "capacity": "3.12",
      "energy": "1852.19",
      "id": 279,
      "lat": 0,
      "lon": 0,
      "name": "嘉兴文昌路项目1",
      "power": "455.0"
    }
  ]
}